InsideWCF/Chapter05/MessagesTest/Messages/WriteMessageMethodTest.msg

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header><a:Action s:mustUnderstand="1">SomeAction</a:Action><MyName xmlns="MyNamespace">MyValue</MyName><CUSTOM NAME CUSTOM_VALUE="CUSTOM VALUE" xmlns="CUSTOM NAMESPACE" /><a:MessageID>urn:uuid:fe19c16d-3f5c-413f-9eb3-e09a4c675c2a</a:MessageID><a:To s:mustUnderstand="1">net.tcp://address_to/</a:To><a:FaultTo><a:Address>net.tcp://address_faultto/</a:Address></a:FaultTo><a:ReplyTo><a:Address>net.tcp://address_replyto/</a:Address></a:ReplyTo></s:Header><s:Body><CPersonInfo xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://schemas.datacontract.org/2004/07/MessagesTest"><Age>12</Age><Name><FirstName>Timmy</FirstName><LastName>Anderson</LastName></Name></CPersonInfo></s:Body></s:Envelope>